RT-Thread/rt-thread/bsp/stm32/libraries/STM32WLxx_HAL/STM32WLxx_HAL_Driver/Src/stm32wlxx_hal_subghz.c
/*******************************************************************************
 * @file    stm32wlxx_hal_subghz.c
 * @author  MCD Application Team
 * @brief   SUBGHZ HAL module driver.
 *          This file provides firmware functions to manage the following
 *          functionalities of the SUBGHZ peripheral:
 *           + Initialization and de-initialization functions
 *           + IO operation functions
 *           + Peripheral State and Errors functions
 *
 @verbatim
 ==============================================================================
                       ##### How to use this driver #####
 ==============================================================================
 [..]
    The SUBGHZ HAL driver can be used as follows:

    (#) Declare a SUBGHZ_HandleTypeDef handle structure, for example:
        SUBGHZ_HandleTypeDef hUserSubghz;

    (#) Initialize the SUBGHZ low level resources by implementing the @ref HAL_SUBGHZ_MspInit() API:
        (##) PWR configuration
            (+++) Enable the SUBGHZSPI interface clock
            (+++) Enable wakeup signal of the Radio peripheral
        (##) NVIC configuration:
            (+++) Enable the NVIC Radio IRQ ITs for CPU1 (EXTI 44)
            (+++) Configure the Radio interrupt priority

    (#) Initialize the SUBGHZ handle and SUBGHZSPI SPI registers by calling the @ref HAL_SUBGHZ_Init(&hUserSubghz),
        configures also the low level Hardware (GPIO, CLOCK, NVIC...etc) by calling
        the customized @ref HAL_SUBGHZ_MspInit() API.

    (#) For SUBGHZ IO operations, polling operation modes is available within this driver :

    *** Polling mode IO operation      ***
    =====================================
    [..]
      (+) Set and execute a command in blocking mode using @ref HAL_SUBGHZ_ExecSetCmd()
      (+) Get a status blocking mode using @ref HAL_SUBGHZ_ExecGetCmd()
      (+) Write a Data Buffer in blocking mode using @ref HAL_SUBGHZ_WriteBuffer()
      (+) Read a Data Buffer  in blocking mode using @ref HAL_SUBGHZ_ReadBuffer()
      (+) Write Registers (more than 1 byte) in blocking mode using @ref HAL_SUBGHZ_WriteRegisters()
      (+) Read Registers (more than 1 byte) in blocking mode using @ref HAL_SUBGHZ_ReadRegisters()
      (+) Write Register (1 byte) in blocking mode using @ref HAL_SUBGHZ_WriteRegister()
      (+) Read Register (1 byte) in blocking mode using @ref HAL_SUBGHZ_ReadRegister()

    *** SUBGHZ HAL driver macros list ***
    =====================================
    [..]
      (+) @ref __HAL_SUBGHZ_RESET_HANDLE_STATE: Reset the SUBGHZ handle state

#if defined(GENERATOR_CALLBACK_REGISTERING_PRESENT)
     *** SUBGHZ Callback registration  ***
     =====================================

    [..]
     The compilation flag USE_HAL_SUBGHZ_REGISTER_CALLBACKS when set to 1
     allows the user to configure dynamically the driver callbacks.
     Use Functions @ref HAL_SUBGHZ_RegisterCallback() or @ref HAL_SUBGHZ_RegisterAddrCallback()
     to register an interrupt callback.

    [..]
     Function @ref HAL_SUBGHZ_RegisterCallback() allows to register following callbacks:
       (+) MspInitCallback      : callback for Msp Init.
       (+) MspDeInitCallback    : callback for Msp DeInit.
     This function takes as parameters the HAL peripheral handle, the Callback ID
     and a pointer to the user callback function.

    [..]
     Use function @ref HAL_SUBGHZ_UnRegisterCallback to reset a callback to the default
     weak function.
     @ref HAL_SUBGHZ_UnRegisterCallback takes as parameters the HAL peripheral handle,
     and the Callback ID.
     This function allows to reset following callbacks:
       (+) MspInitCallback      : callback for Msp Init.
       (+) MspDeInitCallback    : callback for Msp DeInit.

    [..]
     MspInit and MspDeInit functions are reset to the legacy weak functions in the
     @ref HAL_SUBGHZ_Init()/ @ref HAL_SUBGHZ_DeInit() only when these callbacks are null
     (not registered beforehand).
     If MspInit or MspDeInit are not null, the @ref HAL_SUBGHZ_Init()/ @ref HAL_SUBGHZ_DeInit()
     keep and use the user MspInit/MspDeInit callbacks (registered beforehand) whatever the state.

    [..]
     Callbacks for MspInit/MspDeInit functions can be registered/unregistered
     in @ref HAL_SUBGHZ_STATE_READY or @ref HAL_SUBGHZ_STATE_RESET state,
     thus registered (user) MspInit/DeInit callbacks can be used during the Init/DeInit.
     Then, the user first registers the MspInit/MspDeInit user callbacks
     using @ref HAL_SUBGHZ_RegisterCallback() before calling @ref HAL_SUBGHZ_DeInit()
     or @ref HAL_SUBGHZ_Init() function.

    [..]
     When the compilation flag USE_HAL_SUBGHZ_REGISTER_CALLBACKS is set to 0 or
     not defined, the callback registration feature is not available and all callbacks
     are set to the corresponding weak functions.
#endif
 ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "stm32wlxx_hal.h"

/** @addtogroup STM32WLxx_HAL_Driver
  * @{
  */

/** @defgroup SUBGHZ SUBGHZ
  * @brief SUBGHZ HAL module driver
  * @{
  */
#ifdef HAL_SUBGHZ_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private defines -----------------------------------------------------------*/
/** @defgroup SUBGHZ_Private_Constants SUBGHZ Private Constants
  * @{
  */
#define SUBGHZ_DEFAULT_TIMEOUT     100U    /* HAL Timeout in ms               */
#define SUBGHZ_DUMMY_DATA          0xFFU   /* SUBGHZSPI Dummy Data use for Tx */
#define SUBGHZ_DEEP_SLEEP_ENABLE   1U      /* SUBGHZ Radio in Deep Sleep      */
#define SUBGHZ_DEEP_SLEEP_DISABLE  0U      /* SUBGHZ Radio not in Deep Sleep  */
/**
  * @}
  */

