RT-Thread/rt-thread/bsp/stm32/libraries/STM32WLxx_HAL/STM32WLxx_HAL_Driver/Src/stm32wlxx_hal_subghz.c
/* Private macros ------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/** @defgroup SUBGHZ_Private_Functions SUBGHZ Private Functions
  * @{
  */
HAL_StatusTypeDef SUBGHZ_WaitOnBusy(SUBGHZ_HandleTypeDef *hsubghz);
HAL_StatusTypeDef SUBGHZ_CheckDeviceReady(SUBGHZ_HandleTypeDef *hsubghz);
HAL_StatusTypeDef SUBGHZSPI_Init(uint32_t BaudratePrescaler);
HAL_StatusTypeDef SUBGHZSPI_DeInit(void);
HAL_StatusTypeDef SUBGHZSPI_Transmit(SUBGHZ_HandleTypeDef *hsubghz, uint8_t Data);
HAL_StatusTypeDef SUBGHZSPI_Receive(SUBGHZ_HandleTypeDef *hsubghz, uint8_t *pData);
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup SUBGHZ_Exported_Functions SUBGHZ Exported Functions
  * @{
  */

/** @defgroup SUBGHZ_Exported_Functions_Group1 Initialization and de-initialization functions
 *  @brief    Initialization and Configuration functions
 *
@verbatim
 ===============================================================================
              ##### Initialization and de-initialization functions #####
 ===============================================================================
    [..]  This subsection provides a set of functions allowing to initialize and
          de-initialize the SUBGHZ peripheral:

      (+) User must implement HAL_SUBGHZ_MspInit() function in which he configures
          all related peripherals resources (CLOCK, GPIO, IT and NVIC ).

      (+) Call the function HAL_SUBGHZ_Init() to configure SUBGHZSPI peripheral
          and initialize SUBGHZ Handle.

      (+) Call the function HAL_SUBGHZ_DeInit() to restore the default configuration
          of the SUBGHZ peripheral.

@endverbatim
  * @{
  */

/**
  * @brief  Initialize the SUBGHZ according to the specified parameters
  *         in the SUBGHZ_HandleTypeDef and initialize the associated handle.
  * @param  hsubghz pointer to a SUBGHZ_HandleTypeDef structure that contains
  *         the handle information for SUBGHZ module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SUBGHZ_Init(SUBGHZ_HandleTypeDef *hsubghz)
{
  HAL_StatusTypeDef status;

  /* Check the hsubghz handle allocation */
  if (hsubghz == NULL)
  {
    status = HAL_ERROR;
    return status;
  }

  assert_param(IS_SUBGHZSPI_BAUDRATE_PRESCALER(hsubghz->Init.BaudratePrescaler));

  if (hsubghz->State == HAL_SUBGHZ_STATE_RESET)
  {
    /* Allocate lock resource and initialize it */
    hsubghz->Lock = HAL_UNLOCKED;

#if (USE_HAL_SUBGHZ_REGISTER_CALLBACKS == 1)
    /* Init the SUBGHZ Callback settings */
    hsubghz->TxCpltCallback              = HAL_SUBGHZ_TxCpltCallback;               /* Legacy weak TxCpltCallback              */
    hsubghz->RxCpltCallback              = HAL_SUBGHZ_RxCpltCallback;               /* Legacy weak RxCpltCallback              */
    hsubghz->PreambleDetectedCallback    = HAL_SUBGHZ_PreambleDetectedCallback;     /* Legacy weak PreambleDetectedCallback    */
    hsubghz->SyncWordValidCallback       = HAL_SUBGHZ_SyncWordValidCallback;        /* Legacy weak SyncWordValidCallback       */
    hsubghz->HeaderValidCallback         = HAL_SUBGHZ_HeaderValidCallback;          /* Legacy weak HeaderValidCallback         */
    hsubghz->HeaderErrorCallback         = HAL_SUBGHZ_HeaderErrorCallback;          /* Legacy weak HeaderErrorCallback         */
    hsubghz->CRCErrorCallback            = HAL_SUBGHZ_CRCErrorCallback;             /* Legacy weak CRCErrorCallback            */
    hsubghz->CADDoneCallback             = HAL_SUBGHZ_CADDoneCallback;              /* Legacy weak CADDoneCallback             */
    hsubghz->CADActivityDetectedCallback = HAL_SUBGHZ_CADActivityDetectedCallback;  /* Legacy weak CADActivityDetectedCallback */
    hsubghz->RxTxTimeoutCallback         = HAL_SUBGHZ_RxTxTimeoutCallback;          /* Legacy weak RxTxTimeoutCallback         */

    if (hsubghz->MspInitCallback == NULL)
    {
      hsubghz->MspInitCallback = HAL_SUBGHZ_MspInit; /* Legacy weak MspInit  */
    }

    /* Init the low level hardware : GPIO, CLOCK, NVIC... */
    hsubghz->MspInitCallback(hsubghz);
#else
    /* Init the low level hardware : GPIO, CLOCK, NVIC... */
    HAL_SUBGHZ_MspInit(hsubghz);
#endif /* USE_HAL_ SUBGHZ_REGISTER_CALLBACKS */
  }

  hsubghz->State = HAL_SUBGHZ_STATE_BUSY;

  /* Initialize SUBGHZSPI Peripheral */
  status = SUBGHZSPI_Init(hsubghz->Init.BaudratePrescaler);

  hsubghz->DeepSleep = SUBGHZ_DEEP_SLEEP_ENABLE;
  hsubghz->ErrorCode = HAL_SUBGHZ_ERROR_NONE;
  hsubghz->State     = HAL_SUBGHZ_STATE_READY;

  return status;
}

/**
  * @brief  De-Initialize the SUBGHZ peripheral.
  * @param  hsubghz pointer to a SUBGHZ_HandleTypeDef structure that contains
  *         the handle information for SUBGHZ module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SUBGHZ_DeInit(SUBGHZ_HandleTypeDef *hsubghz)
{
  HAL_StatusTypeDef status;

  /* Check the SUBGHZ handle allocation */
  if (hsubghz == NULL)
  {
    status = HAL_ERROR;
    return status;
  }

  hsubghz->State = HAL_SUBGHZ_STATE_BUSY;

  /* DeInitialize SUBGHZSPI Peripheral */
  status = SUBGHZSPI_DeInit();

#if (USE_HAL_SUBGHZ_REGISTER_CALLBACKS == 1)
  if (hsubghz->MspDeInitCallback == NULL)
  {
    hsubghz->MspDeInitCallback = HAL_SUBGHZ_MspDeInit; /* Legacy weak MspDeInit  */
  }

  /* DeInit the low level hardware: GPIO, CLOCK, NVIC... */
  hsubghz->MspDeInitCallback(hsubghz);
#else
  /* DeInit the low level hardware: GPIO, CLOCK, NVIC... */
  HAL_SUBGHZ_MspDeInit(hsubghz);
#endif /* USE_HAL_SUBGHZ_REGISTER_CALLBACKS */

  hsubghz->ErrorCode = HAL_SUBGHZ_ERROR_NONE;
  hsubghz->State     = HAL_SUBGHZ_STATE_RESET;

  /* Release Lock */
  __HAL_UNLOCK(hsubghz);

  return status;
}

/**
  * @brief  Initialize the SUBGHZ MSP.
  * @param  hsubghz pointer to a SUBGHZ_HandleTypeDef structure that contains
  *         the handle information for SUBGHZ module.
  * @retval None
  */
__weak void HAL_SUBGHZ_MspInit(SUBGHZ_HandleTypeDef *hsubghz)
{
  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_SUBGHZ_MspInit should be implemented in the user file
   */

