RT-Thread/rt-thread/bsp/stm32/libraries/STM32WLxx_HAL/STM32WLxx_HAL_Driver/Src/stm32wlxx_hal_subghz.c
  /* De-asserts the reset signal of the Radio peripheral */
  LL_RCC_RF_DisableReset();

  /* Verify that Radio in reset status flag is set */
  while (LL_RCC_IsRFUnderReset() != 0UL) {};

  /* Asserts the reset signal of the Radio peripheral */
  LL_PWR_UnselectSUBGHZSPI_NSS();

#if defined(CM0PLUS)
  /* Enable EXTI 44 : Radio IRQ ITs for CPU2 */
  LL_C2_EXTI_EnableIT_32_63(LL_EXTI_LINE_44);

  /* Enable wakeup signal of the Radio peripheral */
  LL_C2_PWR_SetRadioBusyTrigger(LL_PWR_RADIO_BUSY_TRIGGER_WU_IT);
#else
  /* Enable EXTI 44 : Radio IRQ ITs for CPU1 */
  LL_EXTI_EnableIT_32_63(LL_EXTI_LINE_44);

  /* Enable wakeup signal of the Radio peripheral */
  LL_PWR_SetRadioBusyTrigger(LL_PWR_RADIO_BUSY_TRIGGER_WU_IT);
#endif

  /* Clear Pending Flag */
  LL_PWR_ClearFlag_RFBUSY();

  /* Enable the SUBGHZSPI peripheral clock */
  __HAL_RCC_SUBGHZSPI_CLK_ENABLE();

  /* Force the SUBGHZSPI Periheral Clock Reset */
  __HAL_RCC_SUBGHZSPI_FORCE_RESET();

  /* Release the SUBGHZSPI Periheral Clock Reset */
  __HAL_RCC_SUBGHZSPI_RELEASE_RESET();

  /* Enable Radio NVIC Interrupt */
  HAL_NVIC_EnableIRQ(Radio_IRQn);

  /* Prevent unused argument(s) compilation warning */
  UNUSED(hsubghz);
}

/**
  * @brief  De-Initialize the SUBGHZ MSP.
  * @param  hsubghz pointer to a SUBGHZ_HandleTypeDef structure that contains
  *         the handle information for SUBGHZ module.
  * @retval None
  */
__weak void HAL_SUBGHZ_MspDeInit(SUBGHZ_HandleTypeDef *hsubghz)
{
  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_SUBGHZ_MspDeInit should be implemented in the user file
   */

#if defined(CM0PLUS)
  /* Disable EXTI 44 : Radio IRQ ITs for CPU2 */
  LL_C2_EXTI_DisableIT_32_63(LL_EXTI_LINE_44);

  /* Disable wakeup signal of the Radio peripheral */
  LL_C2_PWR_SetRadioBusyTrigger(LL_PWR_RADIO_BUSY_TRIGGER_NONE);
#else
  /* Disable EXTI 44 : Radio IRQ ITs for CPU1 */
  LL_EXTI_DisableIT_32_63(LL_EXTI_LINE_44);

  /* Disable wakeup signal of the Radio peripheral */
  LL_PWR_SetRadioBusyTrigger(LL_PWR_RADIO_BUSY_TRIGGER_NONE);
#endif

  /* Disable the Radio peripheral  Reset signal */
  LL_RCC_RF_DisableReset();

  /* Force the SUBGHZSPI Periheral Clock Reset */
  __HAL_RCC_SUBGHZSPI_FORCE_RESET();

  /* Release the SUBGHZSPI Periheral Clock Reset */
  __HAL_RCC_SUBGHZSPI_RELEASE_RESET();

  /* Disable the SUBGHZSPI peripheral clock */
  __HAL_RCC_SUBGHZSPI_CLK_DISABLE();

  /* Disable Radio NVIC Interrupt */
  HAL_NVIC_DisableIRQ(Radio_IRQn);

  /* Prevent unused argument(s) compilation warning */
  UNUSED(hsubghz);
}

#if (USE_HAL_SUBGHZ_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register a User SUBGHZ Callback
  *         To be used instead of the weak predefined callback
  * @param  hsubghz pointer to a SUBGHZ_HandleTypeDef structure that contains
  *         the configuration information for the specified SUBGHZ.
  * @param  CallbackID ID of the callback to be registered
  * @param  pCallback pointer to the Callback function
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SUBGHZ_RegisterCallback(SUBGHZ_HandleTypeDef *hsubghz, HAL_SUBGHZ_CallbackIDTypeDef CallbackID, pSUBGHZ_CallbackTypeDef pCallback)
{
  HAL_StatusTypeDef status = HAL_OK;

  if (pCallback == NULL)
  {
    /* Update the error code */
    hsubghz->ErrorCode |= HAL_SUBGHZ_ERROR_INVALID_CALLBACK;

    return HAL_ERROR;
  }

  /* Process locked */
  __HAL_LOCK(hsubghz);

  if (HAL_SUBGHZ_STATE_READY == hsubghz->State)
  {
    switch (CallbackID)
    {
      case HAL_SUBGHZ_TX_COMPLETE_CB_ID :
        hsubghz->TxCpltCallback = pCallback;
        break;

      case HAL_SUBGHZ_RX_COMPLETE_CB_ID :
        hsubghz->RxCpltCallback = pCallback;
        break;

      case HAL_SUBGHZ_PREAMBLE_DETECTED_CB_ID :
        hsubghz->PreambleDetectedCallback = pCallback;
        break;

      case HAL_SUBGHZ_SYNCWORD_VALID_CB_ID :
        hsubghz->SyncWordValidCallback = pCallback;
        break;

      case HAL_SUBGHZ_HEADER_VALID_CB_ID :
        hsubghz->HeaderValidCallback = pCallback;
        break;

      case HAL_SUBGHZ_HEADER_ERROR_CB_ID :
        hsubghz->HeaderErrorCallback = pCallback;
        break;

      case HAL_SUBGHZ_CRC_ERROR_CB_ID :
        hsubghz->CRCErrorCallback = pCallback;
        break;

      case HAL_SUBGHZ_CAD_DONE_CB_ID :
        hsubghz->CADDoneCallback = pCallback;
        break;

      case HAL_SUBGHZ_CAD_ACTIVITY_DETECTED_CB_ID :
        hsubghz->CADActivityDetectedCallback = pCallback;
        break;

      case HAL_SUBGHZ_RX_TX_TIMEOUT_CB_ID :
        hsubghz->RxTxTimeoutCallback = pCallback;
        break;

      case HAL_SUBGHZ_MSPINIT_CB_ID :
        hsubghz->MspInitCallback = pCallback;
        break;

      case HAL_SUBGHZ_MSPDEINIT_CB_ID :
        hsubghz->MspDeInitCallback = pCallback;
        break;

      default :
        /* Update the error code */
        hsubghz->ErrorCode = HAL_SUBGHZ_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  HAL_ERROR;
        break;
    }
  }
  else if (HAL_SUBGHZ_STATE_RESET == hsubghz->State)
  {
    switch (CallbackID)
    {
      case HAL_SUBGHZ_MSPINIT_CB_ID :
        hsubghz->MspInitCallback = pCallback;
        break;

      case HAL_SUBGHZ_MSPDEINIT_CB_ID :
        hsubghz->MspDeInitCallback = pCallback;
        break;

      default :
        /* Update the error code */
        hsubghz->ErrorCode = HAL_SUBGHZ_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  HAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    hsubghz->ErrorCode = HAL_SUBGHZ_ERROR_INVALID_CALLBACK;

    /* Return error status */
    status =  HAL_ERROR;
  }

  /* Release Lock */
  __HAL_UNLOCK(hsubghz);

  return status;
}

/**
  * @brief  Unregister an SUBGHZ Callback
  *         SUBGHZ callback is redirected to the weak predefined callback
  * @param  hsubghz pointer to a SUBGHZ_HandleTypeDef structure that contains
  *         the configuration information for the specified SUBGHZ.
  * @param  CallbackID ID of the callback to be unregistered
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SUBGHZ_UnRegisterCallback(SUBGHZ_HandleTypeDef *hsubghz, HAL_SUBGHZ_CallbackIDTypeDef CallbackID)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Process locked */
  __HAL_LOCK(hsubghz);

  if (HAL_SUBGHZ_STATE_READY == hsubghz->State)
  {
    /* call legacy weak callback function */
    switch (CallbackID)
    {
      case HAL_SUBGHZ_TX_COMPLETE_CB_ID :
        hsubghz->TxCpltCallback = HAL_SUBGHZ_TxCpltCallback;
        break;

      case HAL_SUBGHZ_RX_COMPLETE_CB_ID :
        hsubghz->RxCpltCallback = HAL_SUBGHZ_RxCpltCallback;
        break;

