RT-Thread/rt-thread/bsp/stm32/libraries/STM32WLxx_HAL/STM32WLxx_HAL_Driver/Src/stm32wlxx_hal_subghz.c
      case HAL_SUBGHZ_PREAMBLE_DETECTED_CB_ID :
        hsubghz->PreambleDetectedCallback = HAL_SUBGHZ_PreambleDetectedCallback;
        break;

      case HAL_SUBGHZ_SYNCWORD_VALID_CB_ID :
        hsubghz->SyncWordValidCallback = HAL_SUBGHZ_SyncWordValidCallback;
        break;

      case HAL_SUBGHZ_HEADER_VALID_CB_ID :
        hsubghz->HeaderValidCallback = HAL_SUBGHZ_HeaderValidCallback;
        break;

      case HAL_SUBGHZ_HEADER_ERROR_CB_ID :
        hsubghz->HeaderErrorCallback = HAL_SUBGHZ_HeaderErrorCallback;
        break;

      case HAL_SUBGHZ_CRC_ERROR_CB_ID :
        hsubghz->CRCErrorCallback = HAL_SUBGHZ_CRCErrorCallback;
        break;

      case HAL_SUBGHZ_CAD_DONE_CB_ID :
        hsubghz->CADDoneCallback = HAL_SUBGHZ_CADDoneCallback;
        break;

      case HAL_SUBGHZ_CAD_ACTIVITY_DETECTED_CB_ID :
        hsubghz->CADActivityDetectedCallback = HAL_SUBGHZ_CADActivityDetectedCallback;
        break;

      case HAL_SUBGHZ_RX_TX_TIMEOUT_CB_ID :
        hsubghz->RxTxTimeoutCallback = HAL_SUBGHZ_RxTxTimeoutCallback;
        break;

      case HAL_SUBGHZ_MSPINIT_CB_ID :
        hsubghz->MspInitCallback = HAL_SUBGHZ_MspInit;
        break;

      case HAL_SUBGHZ_MSPDEINIT_CB_ID :
        hsubghz->MspDeInitCallback = HAL_SUBGHZ_MspDeInit;
        break;

      default :
        /* Update the error code */
        hsubghz->ErrorCode = HAL_SUBGHZ_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  HAL_ERROR;
        break;
    }
  }
  else if (HAL_SUBGHZ_STATE_RESET == hsubghz->State)
  {
    switch (CallbackID)
    {
      case HAL_SUBGHZ_MSPINIT_CB_ID :
        hsubghz->MspInitCallback = HAL_SUBGHZ_MspInit;
        break;

      case HAL_SUBGHZ_MSPDEINIT_CB_ID :
        hsubghz->MspDeInitCallback = HAL_SUBGHZ_MspDeInit;
        break;

      default :
        /* Update the error code */
        hsubghz->ErrorCode = HAL_SUBGHZ_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  HAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    hsubghz->ErrorCode = HAL_SUBGHZ_ERROR_INVALID_CALLBACK;

    /* Return error status */
    status =  HAL_ERROR;
  }

  /* Release Lock */
  __HAL_UNLOCK(hsubghz);

  return status;
}
#endif /* USE_HAL_SUBGHZ_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup SUBGHZ_Exported_Functions_Group2 IO operation functions
 *  @brief   Data transfers functions
 *
@verbatim
  ==============================================================================
                      ##### IO operation functions #####
 ===============================================================================
 [..]
    This subsection provides a set of functions allowing to manage the SUBGHZ
    data transfers.

    [..] The SUBGHZ supports Read and Write operation:

    (#) There are four modes of transfer:
       (++) Set operation: The Set Command operation is performed in polling mode.
            The HAL status of command processing is returned by the same function
            after finishing transfer.
       (++) Get operation: The Get Status operation is performed using polling mode
            These API update buffer in parameter to retrieve status of command.
            These API return the HAL status
       (++) Write operation: The write operation is performed in polling mode.
            The HAL status of all data processing is returned by the same function
            after finishing transfer.
       (++) Read operation: The read operation is performed using polling mode
            These APIs return the HAL status.

    (#) Blocking mode functions are :
        (++) HAL_SUBGHZ_ExecSetCmd(
        (++) HAL_SUBGHZ_ExecGetCmd()
        (++) HAL_SUBGHZ_WriteBuffer()
        (++) HAL_SUBGHZ_ReadBuffer()
        (++) HAL_SUBGHZ_WriteRegisters()
        (++) HAL_SUBGHZ_ReadRegisters()
        (++) HAL_SUBGHZ_WriteRegister()
        (++) HAL_SUBGHZ_ReadRegister()

@endverbatim
  * @{
  */

/**
  * @brief  Write data buffer at an Address to configurate the peripheral
  * @param  hsubghz pointer to a SUBGHZ_HandleTypeDef structure that contains
  *         the configuration information for the specified SUBGHZ.
  * @param  Address register to configurate
  * @param  pBuffer pointer to a data buffer
  * @param  Size    amount of data to be sent
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SUBGHZ_WriteRegisters(SUBGHZ_HandleTypeDef *hsubghz, uint16_t Address, uint8_t *pBuffer, uint16_t Size)
{
  HAL_StatusTypeDef status;

  if (hsubghz->State == HAL_SUBGHZ_STATE_READY)
  {
    /* Process Locked */
    __HAL_LOCK(hsubghz);

    hsubghz->State = HAL_SUBGHZ_STATE_BUSY;

    (void)SUBGHZ_CheckDeviceReady(hsubghz);

    /* NSS = 0 */
    LL_PWR_SelectSUBGHZSPI_NSS();

    (void)SUBGHZSPI_Transmit(hsubghz, SUBGHZ_RADIO_WRITE_REGISTER);
    (void)SUBGHZSPI_Transmit(hsubghz, (uint8_t)((Address & 0xFF00U) >> 8U));
    (void)SUBGHZSPI_Transmit(hsubghz, (uint8_t)(Address & 0x00FFU));

    for (uint16_t i = 0U; i < Size; i++)
    {
      (void)SUBGHZSPI_Transmit(hsubghz, pBuffer[i]);
    }

    /* NSS = 1 */
    LL_PWR_UnselectSUBGHZSPI_NSS();

    (void)SUBGHZ_WaitOnBusy(hsubghz);

    if (hsubghz->ErrorCode != HAL_SUBGHZ_ERROR_NONE)
    {
      status = HAL_ERROR;
    }
    else
    {
      status = HAL_OK;
    }

    hsubghz->State = HAL_SUBGHZ_STATE_READY;

    /* Process Unlocked */
    __HAL_UNLOCK(hsubghz);

    return status;
  }
  else
  {
    return HAL_BUSY;
  }
}

/**
  * @brief  Read data register at an Address in the peripheral
  * @param  hsubghz pointer to a SUBGHZ_HandleTypeDef structure that contains
  *         the configuration information for the specified SUBGHZ.
  * @param  Address register to configurate
  * @param  pBuffer pointer to a data buffer
  * @param  Size    amount of data to be sent
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SUBGHZ_ReadRegisters(SUBGHZ_HandleTypeDef *hsubghz, uint16_t Address, uint8_t *pBuffer, uint16_t Size)
{
  HAL_StatusTypeDef status;
  uint8_t *pData = pBuffer;

